In [2]:
import pandas as pd
df = pd.DataFrame({"Fruits":["Apple","Banana","Banana","Mango","Banana"],
                  "Number":[5,None,3,None,1]})
df

   Fruits  Number
0   Apple     5.0
1  Banana     NaN
2  Banana     3.0
3   Mango     NaN
4  Banana     1.0

In [3]:
# Check for missing or null
df.isnull().sum()

Fruits    0
Number    2
dtype: int64

In [5]:
df.isnull().sum(axis=1)

0    0
1    1
2    0
3    1
4    0
dtype: int64

In [6]:
df.dropna()

   Fruits  Number
0   Apple     5.0
2  Banana     3.0
4  Banana     1.0

In [7]:
df = pd.DataFrame({"Fruits":["Apple","Banana","Banana","Mango","Banana"],
                  "Number":[5,None,3,None,1]})
df.dropna(axis=1)

   Fruits
0   Apple
1  Banana
2  Banana
3   Mango
4  Banana

In [12]:
from sklearn.preprocessing import Imputer
import numpy as np

arr = np.array([[5,3,2,2],[3,None,1,9],[5,2,7,None]])
imputer = Imputer(strategy='mean')
imp = imputer.fit(arr)
imputer.transform(arr)

array([[5. , 3. , 2. , 2. ],
       [3. , 2.5, 1. , 9. ],
       [5. , 2. , 7. , 5.5]])